{
    "tips": [
        "In Fl Studio you can save files as templates and the use it as your startup template. Use it to pump out ideas as fast as possible as it’s important to execute your ideas quickly.",
        "In Fl, if your project file has a bunch of unused samples, instruments or automation go to tools, macros and select unused channels. Then go into the pattern view, click this and hit delete selected. This will save memory, cpu and declutter your file.",
        "In Fl, you can create multiple arrangements in the same project file. By going to arrangement at the playlist, add one. You can now switch between multiple arrangements.",
        "In Fl, you can scroll on effects to quickly move them up or down and rearrange them. You can also click the arrow, and then drag the save preset as button to quickly copy the effect and its settings onto other slots, other mixer channels, or even into patcher.",
        "A big problem with Fl Studio is that you have to juggle a lot of windows. If it ever overwhelms you hit Alt + F12 to close all plugin windows. Alternatively go to View, close all plugin windows. I recommend to do this sometimes as having the plugin UI open in the background takes a lot more CPU than it should.",
        "In Fl you can detach your plugin windows and drag them onto other monitors.",
        "To color Fl go to options and theme settings. Select a preset or make custom adjustments.",
        "In Fl Studio, in the help section you can find diagnostic. In here you can find tools to help with crashing or corrupted projects.",
        "In Fl, when hovering over or moving certain parameters you can see the exact values up here in the left corner",
        "Tired of always assigning audio files to your mixer channels in Fl? Select a Track in the playlist, right click, track mode, audio track and select your target mixer channel. Now any audio that you put onto this track will automatically be assigned to your mixer channel. If you right click and group a track below this one it inherits the audio track assignment and you have extra space for automation clips or more audio files, and you can neatly collapse them to keep an organized project file.",
        "To stay key consistent without music theory in Fl Studio right click on this note icon, select your scale. (I like playing around with pentatonic, Phrygian and Neopolitan modes) You will see that the brighter notes are the ones from your key. If you hit snap to scale you can only place down key consistent notes. Please note that it’s cool to break or of key sometimes.",
        "You can create disperser with Fl Studio Multiband Delay. Load it up, set it to steep, enable 1x and play with the scale. A negative scale creates the classic disperser downwards motion. A positive scale creates an upwards motion. To really exaggerate the effect disable 1x again. Note that both methods i showed can't be easily tuned to a note like the Kilohearts vst.",
        "Use the precomputed effects section in the sampler. You have an EQ to accentuate the highs or lows. You have ring mod. You have a lowpass filter. Gain and clipping. Stereo delay that offsets the left or right channel and makes the sound wide. You have two reverbs and this pogo knob that does some weird squashing stuff. These bake directly into the sample. Wich means you can’t automate them, but is useful a lot of the times.",
        "Ever wanted to copy a melody to another project file in Fl? You can click the arrow in the piano roll, go to file and hit save score as. Here you can save your scores and open them up elsewhere. And while we’re already here, Fl studio has midi scripts that alter your notes based on code. Go to tools and select one here. Humanize for example is very useful to make your score feel like it’s performed by a human.",
        "You can automate the mixer assignment in Fl",
        "Go into your documents folder, image-line, fl studio, presets, plugin database. In these two folders you can find the structure for the plugin selector. You can organize them into your own categories.",
        "You can go onto the image line forums and download patcher presets that people put up for free! There’s even someone who made a video game inside of patcher!",
        "In Serum you can render the patch to one of the oscillators. Basically resampling but for synths",
        "Decibel (dB) measures the intensity of sound or the power level of an electrical signal. It measures relative to an arbitrary reference level. Most often the reference level is defined as the threshold of human hearing which is the loudest sound that a human can’t hear. However in a DAW it’s entirely arbitrary, which means my songs are actually a million dB and I won the loudness war because monkey brain see bigger number. It’s a logarithmic scale which means a 10dB increase is a tenfold increase in intensity."
    ]
}